#ifndef _GAME_ENEMYINFO_H
#define _GAME_ENEMYINFO_H

#include "types.h"

namespace Game {

struct EnemyInfo {
	char* m_name;        // _00
	char m_id;           // _04
	char m_parentID;     // _05
	char m_members;      // _06
	u16 m_flags;         // _07
	char* m_modelName;   // _0C
	char* m_animName;    // _10
	char* m_animMgrName; // _14
	char* m_textureName; // _18
	char* m_paramName;   // _1C
	char* m_collName;    // _20
	char* m_stoneName;   // _24
	s32 m_childID;       // _28
	s32 m_childNum;      // _2C
	char m_bitterDrops;  // _30
};

enum EBitterDropType { // ID
	BDT_Weak      = 0,
	BDT_Normal    = 1,
	BDT_Strong    = 2,
	BDT_Triple    = 3,
	BDT_Empty     = 4,
	BDT_EmptyTwo  = 5,
	BDT_MiniBoss  = 6,
	BDT_Boss      = 7,
	BDT_FinalBoss = 8,
};
// clang-format off
enum EEnemyTypeID {//ID      Common Name
    EnemyID_Pelplant       = 0,	  // Pellet Posy
    EnemyID_Kochappy       = 1,	  // Dwarf Red Bulborb
    EnemyID_Chappy         = 2,	  // Red Bulborb
    EnemyID_BluePom        = 3,	  // Lapis Lazuli Candypop Bud
    EnemyID_RedPom         = 4,	  // Crimson Candypop Bud
    EnemyID_YellowPom      = 5,	  // Golden Candypop Bud
    EnemyID_BlackPom       = 6,	  // Violet Candypop Bud
    EnemyID_WhitePom       = 7,	  // Ivory Candypop Bud
    EnemyID_RandPom        = 8,	  // Queen Candypop Bud
    EnemyID_Kogane         = 9,	  // Iridescent Flint Beetle
    EnemyID_Wealthy        = 10,  // Iridescent Glint Beetle
    EnemyID_Fart           = 11,  // Doodlebug
